{"backend": "tensorflow", "config": [{"config": {"mask_value": -1, "batch_input_shape": [null, 3, 24], "dtype": "float32", "trainable": true, "name": "masking_1"}, "class_name": "Masking"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "units": 32, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "use_bias": true, "stateful": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "go_backwards": false, "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "kernel_regularizer": null, "unroll": false, "bias_regularizer": null, "return_sequences": false, "bias_constraint": null, "activity_regularizer": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 32], "kernel_constraint": null, "bias_constraint": null, "units": 13, "activity_regularizer": null, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.0"}