{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 24], "trainable": true, "name": "masking_1", "mask_value": -1}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "return_state": false, "bias_constraint": null, "unit_forget_bias": true, "use_bias": true, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_regularizer": null, "units": 32, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "recurrent_dropout": 0.0, "dropout": 0.2, "stateful": false, "return_sequences": false, "implementation": 1}}, {"class_name": "Dense", "config": {"units": 13, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 32], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "2.2.0"}