{"config": [{"config": {"name": "masking_1", "mask_value": -1, "dtype": "float32", "batch_input_shape": [null, 5, 24], "trainable": true}, "class_name": "Masking"}, {"config": {"activation": "tanh", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "go_backwards": false, "bias_constraint": null, "use_bias": true, "recurrent_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "units": 32, "bias_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "implementation": 1, "recurrent_regularizer": null, "dropout": 0.2}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "units": 13, "activation": "linear", "trainable": true, "name": "dense_1", "batch_input_shape": [null, 32], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0"}